DataProcessors/ТОСервер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ТОСервер</Name>
			<Comment>Механизм взаимодействия с торговым оборудованием.</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>(Общ) Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС14</Name>
					<Comment>(Общ) Ставка НДС 14%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>(Общ) Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ТОСервер/Ext/ManagerModule.bsl
// Возвращает строковое значение ставки НДС по значению перечисления
//
// Параметры:
// 		СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - значение перечисления СтавкиНДС
//
// Возвращаемое значение:
// 		Строка - Значение ставки НДС строкой
//
Функция ПолучитьСтавкуНДССтрокой(СтавкаНДС) Экспорт
	
	Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
		ЗначениеНалога = "20";
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7") Тогда
		ЗначениеНалога = "7";
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС14") Тогда
		ЗначениеНалога = "14";
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0") Тогда
		ЗначениеНалога = "0";
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС") Тогда
		ЗначениеНалога = "Без НДС";
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НеНДС") Тогда
		ЗначениеНалога = "Не НДС";
	Иначе
		ЗначениеНалога = Строка(СтавкаНДС);
	КонецЕсли;
	
	Возврат ЗначениеНалога;
	
КонецФункции // ПолучитьСтавкуНДССтрокой()

// Возвращает строковое значение ставки НДС по значению перечисления
//
// Параметры:
// 		СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - значение перечисления СтавкиНДС
//
// Возвращаемое значение:
// 		Строка - Значение ставки НДС строкой
//
Функция ПолучитьПоСтрокеСтавкуНДС(ЗначениеНалога) Экспорт
	
	Если ЗначениеНалога = "20" Тогда
		СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20");
	ИначеЕсли ЗначениеНалога = "14" Тогда
		СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС14");
	ИначеЕсли ЗначениеНалога = "7" Тогда
		СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7");
	ИначеЕсли ЗначениеНалога = "0" Тогда
		СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0");
	ИначеЕсли ЗначениеНалога = "Без НДС" Тогда
		СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
	Иначе
		СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НеНДС");
	КонецЕсли;
	
	Возврат СтавкаНДС;
		
КонецФункции // ПолучитьСтавкуНДССтрокой()
